wagiminator/CH32V003-GameConsole/software/tiny_arkanoid/src/system.h
#define AWU_sleep(ms)         {AWU_set(ms); SLEEP_WFE_now();}
#define AWU_stdby(ms)         {AWU_set(ms); STDBY_WFE_now();}

// Set automatic wake-up timer in milliseconds
#define AWU_set(ms) \
  (ms <    64 ? ({PWR->AWUPSC = 0b1000; PWR->AWUWR = (ms);    }) : \
  (ms <   128 ? ({PWR->AWUPSC = 0b1001; PWR->AWUWR = (ms)>>1; }) : \
  (ms <   256 ? ({PWR->AWUPSC = 0b1010; PWR->AWUWR = (ms)>>2; }) : \
  (ms <   512 ? ({PWR->AWUPSC = 0b1011; PWR->AWUWR = (ms)>>3; }) : \
  (ms <  1024 ? ({PWR->AWUPSC = 0b1100; PWR->AWUWR = (ms)>>4; }) : \
  (ms <  2048 ? ({PWR->AWUPSC = 0b1101; PWR->AWUWR = (ms)>>5; }) : \
  (ms <  5120 ? ({PWR->AWUPSC = 0b1110; PWR->AWUWR = (ms)/80; }) : \
  (ms < 30720 ? ({PWR->AWUPSC = 0b1111; PWR->AWUWR = (ms)/480;}) : \
  (0)))))))))

// ===================================================================================
// Sleep Functions
// ===================================================================================
void SLEEP_WFI_now(void);   // put device into sleep, wake up by interrupt
void SLEEP_WFE_now(void);   // put device into sleep, wake up by event
void STDBY_WFI_now(void);   // put device into standby (deep sleep), wake up interrupt
void STDBY_WFE_now(void);   // put device into standby (deep sleep), wake up event

#define SLEEP_ms(n)           {AWU_start(n); SLEEP_WFE_now(); AWU_stop();}
#define STDBY_ms(n)           {AWU_start(n); STDBY_WFE_now(); AWU_stop();}

// ===================================================================================
// Programmable Voltage Detector (PVD) Functions
// ===================================================================================
#define PVD_enable()          {RCC->APB1PCENR |= RCC_PWREN; PWR->CTLR |= PWR_CTLR_PVDE;}
#define PVD_set_2V7()         PWR->CTLR &= ~PWR_CTLR_PLS
#define PVD_set_2V9()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b001 << 5)
#define PVD_set_3V15()        PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b010 << 5)
#define PVD_set_3V3()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b011 << 5)
#define PVD_set_3V5()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b100 << 5)
#define PVD_set_3V7()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b101 << 5)
#define PVD_set_3V9()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | (0b110 << 5)
#define PVD_set_4V2()         PWR->CTLR |=  PWR_CTLR_PLS
#define PVD_isLow()           (PWR->CSR & PWR_CSR_PVDO)

#define PVD_RT_enable()       EXTI->RTENR  |=  ((uint32_t)1 << 8)
#define PVD_RT_disable()      EXTI->RTENR  &= ~((uint32_t)1 << 8)
#define PVD_FT_enable()       EXTI->FTENR  |=  ((uint32_t)1 << 8)
#define PVD_FT_disable()      EXTI->FTENR  &= ~((uint32_t)1 << 8)
#define PVD_EV_enable()       EXTI->EVENR  |=  ((uint32_t)1 << 8)
#define PVD_EV_disable()      EXTI->EVENR  &= ~((uint32_t)1 << 8)
#define PVD_INT_enable()      EXTI->INTENR |=  ((uint32_t)1 << 8)
#define PVD_INT_disable()     EXTI->INTENR &= ~((uint32_t)1 << 8)

// ===================================================================================
// Interrupt (INT) Functions
// ===================================================================================
#define INT_enable()          __enable_irq()
#define INT_disable()         __disable_irq()
#define INT_ATOMIC_BLOCK      for(INT_ATOMIC_RESTORE, __ToDo = 1; __ToDo; __ToDo = 0)
#define INT_ATOMIC_RESTORE    uint32_t __reg_save __attribute__((__cleanup__(__iRestore))) = __iSave()

// Save interrupt status and disable interrupts
static inline uint32_t __iSave(void) {
  uint32_t result, temp;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mstatus     \n"
    "andi	%1, %0, ~0x88   \n"
    "csrw	mstatus, %1     \n"
    "andi	%0, %0, 0x88" : "=r" (result), "=r" (temp)
  );
  return result;
}

// Restore interrupt status
static inline void __iRestore(const uint32_t *__s) {
  uint32_t temp;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mstatus     \n"
    "or	  %0, %0, %1      \n"
    "csrw mstatus, %0" : "=&r" (temp) : "r" (*__s)
  );
}

// ===================================================================================
// Device Electronic Signature (ESIG)
// ===================================================================================
#define ESIG_FLASHSIZE      (*(__I uint16_t*)(0x1FFFF7E0))
#define ESIG_UID1           (*(__I uint32_t*)(0x1FFFF7E8))
#define ESIG_UID2           (*(__I uint32_t*)(0x1FFFF7EC))
#define ESIG_UID3           (*(__I uint32_t*)(0x1FFFF7F0))

// ===================================================================================
// Imported System Functions
// ===================================================================================
// Enable Global Interrupt
static inline void __enable_irq(void) {
  uint32_t temp;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mstatus     \n"
    "ori  %0, %0, 0x88    \n"
    "csrw mstatus, %0" : "=r" (temp)
  );
}

// Disable Global Interrupt
static inline void __disable_irq(void) {
  uint32_t temp;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mstatus     \n"
    "andi %0, %0, ~0x88   \n"
    "csrw mstatus, %0" : "=r" (temp)
  );
}

// No OPeration
static inline void __NOP(void) {
  __asm volatile("nop");
}

// Enable NVIC interrupt (interrupt numbers)
static inline void NVIC_EnableIRQ(IRQn_Type IRQn) {
  NVIC->IENR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Disable NVIC interrupt (interrupt numbers)
static inline void NVIC_DisableIRQ(IRQn_Type IRQn) {
  NVIC->IRER[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Get Interrupt Enable State
static inline uint32_t NVIC_GetStatusIRQ(IRQn_Type IRQn) {
  return((uint32_t) ((NVIC->ISR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Get Interrupt Pending State
static inline uint32_t NVIC_GetPendingIRQ(IRQn_Type IRQn) {
  return((uint32_t) ((NVIC->IPR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Set Interrupt Pending
static inline void NVIC_SetPendingIRQ(IRQn_Type IRQn) {
  NVIC->IPSR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Clear Interrupt Pending
static inline void NVIC_ClearPendingIRQ(IRQn_Type IRQn) {
  NVIC->IPRR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Get Interrupt Active State
static inline uint32_t NVIC_GetActive(IRQn_Type IRQn) {
  return((uint32_t)((NVIC->IACTR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Set Interrupt Priority
static inline void NVIC_SetPriority(IRQn_Type IRQn, uint8_t priority) {
  NVIC->IPRIOR[(uint32_t)(IRQn)] = priority;
}

